---
kind: property
id: P:Autodesk.Revit.DB.SlabShapeVertexArray.IsEmpty
source: html/6b0ef9ea-03df-77e7-948b-e5b2c45f8128.htm
---
# Autodesk.Revit.DB.SlabShapeVertexArray.IsEmpty Property

Test to see if the array is empty.

## Syntax (C#)
```csharp
public virtual bool IsEmpty { get; }
```

## Remarks
If the array is empty then True will be returned, otherwise False.